In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame( {
    "Name": ['Baburao','Akshya','Chintu','Bablu','Chapri'],
    "Height in cm": [165, 189, 143, 177, 156],
    "Marks in Physics" : [56, 89, 37, 58, 93],
    "Marks in Chemistry": [75, 83, 95, 94, 90],
    "Marks in Maths" : [78, 45, 27, 87, 64]
})

In [5]:
df

      Name  Height in cm  Marks in Physics  Marks in Chemistry  Marks in Maths
0  Baburao           165                56                  75              78
1   Akshya           189                89                  83              45
2   Chintu           143                37                  95              27
3    Bablu           177                58                  94              87
4   Chapri           156                93                  90              64

In [6]:
df.describe()

       Height in cm  Marks in Physics  Marks in Chemistry  Marks in Maths
count      5.000000          5.000000             5.00000        5.000000
mean     166.000000         66.600000            87.40000       60.200000
std       17.888544         23.776038             8.38451       24.406966
min      143.000000         37.000000            75.00000       27.000000
25%      156.000000         56.000000            83.00000       45.000000
50%      165.000000         58.000000            90.00000       64.000000
75%      177.000000         89.000000            94.00000       78.000000
max      189.000000         93.000000            95.00000       87.000000

In [7]:
df.mean()

C:\Users\nipan\AppData\Local\Temp\ipykernel_14020\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Height in cm          166.0
Marks in Physics       66.6
Marks in Chemistry     87.4
Marks in Maths         60.2
dtype: float64

In [8]:
df.corr()

,Height in cm,Marks in Physics,Marks in Chemistry,Marks in Maths
Height in cm,1.000000,0.498450,-0.361699,0.373908
Marks in Physics,0.498450,1.000000,-0.225984,0.139324
Marks in Chemistry,-0.361699,-0.225984,1.000000,-0.268031
Marks in Maths,0.373908,0.139324,-0.268031,1.000000

**.corr() function checks the correalation between two columns - AS LIKE IN STATA SOFTWARE!...
if value = 1 means 100% correlated
if value positive but less than 1 means less correlated
if value negative means inversely related**

In [9]:
df.count()

Name                  5
Height in cm          5
Marks in Physics      5
Marks in Chemistry    5
Marks in Maths        5
dtype: int64

In [10]:
df.max()

Name                  Chintu
Height in cm             189
Marks in Physics          93
Marks in Chemistry        95
Marks in Maths            87
dtype: object

In [11]:
df.min()

Name                  Akshya
Height in cm             143
Marks in Physics          37
Marks in Chemistry        75
Marks in Maths            27
dtype: object

In [12]:
df.median()

C:\Users\nipan\AppData\Local\Temp\ipykernel_14020\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

Height in cm          165.0
Marks in Physics       58.0
Marks in Chemistry     90.0
Marks in Maths         64.0
dtype: float64

In [13]:
df.std()

C:\Users\nipan\AppData\Local\Temp\ipykernel_14020\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

Height in cm          17.888544
Marks in Physics      23.776038
Marks in Chemistry     8.384510
Marks in Maths        24.406966
dtype: float64

**.std() function calculates standard deviation of coulmn entities**

In [14]:
df.to_csv('Math_operations.csv')

In [17]:
data = pd.read_excel('Excel_file_read.xlsx')

In [18]:
data

      0 First Name   Last Name  Gender        Country  Age        Date    Id
0     1      Dulce       Abril  Female  United States   32  15/10/2017  1562
1     2       Mara   Hashimoto  Female  Great Britain   25  16/08/2016  1582
2     3     Philip        Gent    Male         France   36  21/05/2015  2587
3     4   Kathleen      Hanner  Female  United States   25  15/10/2017  3549
4     5    Nereida     Magwood  Female  United States   58  16/08/2016  2468
..  ...        ...         ...     ...            ...  ...         ...   ...
95   96       Roma  Lafollette  Female  United States   34  15/10/2017  2654
96   97     Felisa        Cail  Female  United States   28  16/08/2016  6525
97   98   Demetria       Abbey  Female  United States   32  21/05/2015  3265
98   99     Jeromy        Danz    Male  United States   39  15/10/2017  3265
99  100   Rasheeda      Alkire  Female  United States   29  16/08/2016  6125

[100 rows x 8 columns]

In [19]:
data.drop(0, axis=1, inplace=True)

In [20]:
data

   First Name   Last Name  Gender        Country  Age        Date    Id
0       Dulce       Abril  Female  United States   32  15/10/2017  1562
1        Mara   Hashimoto  Female  Great Britain   25  16/08/2016  1582
2      Philip        Gent    Male         France   36  21/05/2015  2587
3    Kathleen      Hanner  Female  United States   25  15/10/2017  3549
4     Nereida     Magwood  Female  United States   58  16/08/2016  2468
..        ...         ...     ...            ...  ...         ...   ...
95       Roma  Lafollette  Female  United States   34  15/10/2017  2654
96     Felisa        Cail  Female  United States   28  16/08/2016  6525
97   Demetria       Abbey  Female  United States   32  21/05/2015  3265
98     Jeromy        Danz    Male  United States   39  15/10/2017  3265
99   Rasheeda      Alkire  Female  United States   29  16/08/2016  6125

[100 rows x 7 columns]

In [21]:
data.to_excel('Excel_file_read.xlsx')